"use client"
import React from "react"
import ContactUsForm from "@/components/sections/ContactUsForm"
import Button from "@/components/ui/Button"
import NewsCard from "@/components/ui/NewsCard"
import { NewsItem1 } from "@/types"
import { SearchIcon } from "lucide-react"
import { useTranslations } from "next-intl"

const NewsInsightPage = () => {
  const t = useTranslations("newsInsight")

  const news: NewsItem1[] = [
    {
      id: "1",
      title: "OINBASE – S&P 500 ИНДЕКСИЙН АНХНЫ КРИПТО БИРЖ БОЛЛОО",
      description:
        "АНУ-ын тэргүүлэгч криптовалютын бирж болох Coinbase Global Inc. (COIN.O) энэ сарын 19-нөөс эхлэн S&P 500 индексэд багтах болсноор, тус индексэд багтсан анхны крипто бирж болж, тус салбарын хувьд түүхэн үйл явдал тохиолоо. Энэхүү шийдвэрийн дараа Coinbase-ийн хувьцаа өргөтгөсөн арилжаанд 8–10%-иар өссөн байна. Шинжээчдийн үзэж буйгаар, индексийг дагадаг хөрөнгө оруулалтын сангууд уг хувьцааг багцдаа нэмэх шаардлагатай тул эрэлт нэмэгдэж, үнэ $293 хүрч өсөх боломжтой гэж Oppenheimer онцолжээ. Үүнээс гадна Coinbase нь олон улсын тэлэлтийн стратегийн хүрээнд, крипто деривативын гол тоглогч болох Deribit биржийг $2.9 тэрбумын үнээр худалдан авахаар тохиролцоонд хүрээд байгаа нь тус компанийн гадаад зах зээл дэх байр суурийг улам бататгах хүлээлттэй байна.",
      img: "/card_img_1.png",
    },
    {
      id: "2",
      title: "Ам.долларын индекс сүүлийн гурван жилийн доод түвшинд хүрлээ",
      description:
        "Тариф, эдийн засгийн хэтийн төлөв болон Холбооны нөөцийн сангийн хараат бус байдал алдагдах зэрэг хүчин зүйлс нь хөрөнгө оруулагчдын хүлээлтийг бууруулж буйтай холбоотойгоор ам.долларын индекс сүүлийн гурван жилийн доод түвшинд хүрч 2025 он гарснаас хойш 8.8%-иар сулраад байна. Goldman Sachs-ийн шинжээчид долларын индексийн 90, 95, 101 болон 107 гэсэн үнийн түвшнүүд гол анхаарал хандуулах бүс гэж үзэж байгаа бөгөөд одоогийн уналтын шалтгааныг дараах байдлаар тайлбарлаж байна: • Худалдааны бодлого ба тарифууд – АНУ-ын Ерөнхийлөгчийн зүгээс өргөн хүрээтэй тарифуудыг хэрэгжүүлж эхэлсэн нь, дэлхийн эдийн засгийн өсөлтөд сөргөөр нөлөөлөх нөхцөл байдалд хүргэж байна. Энэ нь хөрөнгө оруулагчдын итгэлийг бууруулж, долларын ханшид дарамт учруулж байгаа",
      img: "/card_img_2.png",
    },
    {
      id: "3",
      title: "АНУ-д 3 дугаар сарын байдлаар зэсийн импорт 600% өслөө",
      description:
        "АНУ-ын ерөнхийлөгч Д.Трамд өнгөрсөн 2 дугаар сард худалдааны яамандаа зэсийн импортын тарифын асуудлаар судалгаа хийхийг үүрэгдсэний дараа 3 дугаар сард тус улсын зэсийн импорт 70,000 тонноос 500,000 орчим тоннд хүрч 600 гаруй хувиар өссөн тухай Mercuria Energy Group мэдээллээ. АНУ-ын зэсийн жилийн хэрэглээ 1.6 сая тоннд хүрсэн ч дотоодын үйлдвэрлэл жилийн нийт хэрэглээний 50%-ийг л хангахуйц байгаа тул тус улсын засгийн газрын зүгээс дотоодын үйлдвэрлэлийг сэргээх зорилгоор тариф ногдуулахаар төлөвлөж байгаа аж. Иймд тариф хэрэгжихээс урьтан импортын хэмжээ өссөн бөгөөд Нью-Йоркийн Comex дээрх үнэ Лондонгийн металлын биржийн үнээс давсан нь арбитражийн боломжийг ч үүсгээд байгаа аж. Хэрэв тариф хэрэгжвэл зэсийн үнэ 12,000-13,000 ам.долларт хүрч өсөх магадлалтай байна.",
      img: "/card_img_3.png",
    },
    {
      id: "2",
      title: "Ам.долларын индекс сүүлийн гурван жилийн доод түвшинд хүрлээ",
      description:
        "Тариф, эдийн засгийн хэтийн төлөв болон Холбооны нөөцийн сангийн хараат бус байдал алдагдах зэрэг хүчин зүйлс нь хөрөнгө оруулагчдын хүлээлтийг бууруулж буйтай холбоотойгоор ам.долларын индекс сүүлийн гурван жилийн доод түвшинд хүрч 2025 он гарснаас хойш 8.8%-иар сулраад байна. Goldman Sachs-ийн шинжээчид долларын индексийн 90, 95, 101 болон 107 гэсэн үнийн түвшнүүд гол анхаарал хандуулах бүс гэж үзэж байгаа бөгөөд одоогийн уналтын шалтгааныг дараах байдлаар тайлбарлаж байна: • Худалдааны бодлого ба тарифууд – АНУ-ын Ерөнхийлөгчийн зүгээс өргөн хүрээтэй тарифуудыг хэрэгжүүлж эхэлсэн нь, дэлхийн эдийн засгийн өсөлтөд сөргөөр нөлөөлөх нөхцөл байдалд хүргэж байна. Энэ нь хөрөнгө оруулагчдын итгэлийг бууруулж, долларын ханшид дарамт учруулж байгаа",
      img: "/card_img_2.png",
    },
    {
      id: "3",
      title: "АНУ-д 3 дугаар сарын байдлаар зэсийн импорт 600% өслөө",
      description:
        "АНУ-ын ерөнхийлөгч Д.Трамд өнгөрсөн 2 дугаар сард худалдааны яамандаа зэсийн импортын тарифын асуудлаар судалгаа хийхийг үүрэгдсэний дараа 3 дугаар сард тус улсын зэсийн импорт 70,000 тонноос 500,000 орчим тоннд хүрч 600 гаруй хувиар өссөн тухай Mercuria Energy Group мэдээллээ. АНУ-ын зэсийн жилийн хэрэглээ 1.6 сая тоннд хүрсэн ч дотоодын үйлдвэрлэл жилийн нийт хэрэглээний 50%-ийг л хангахуйц байгаа тул тус улсын засгийн газрын зүгээс дотоодын үйлдвэрлэлийг сэргээх зорилгоор тариф ногдуулахаар төлөвлөж байгаа аж. Иймд тариф хэрэгжихээс урьтан импортын хэмжээ өссөн бөгөөд Нью-Йоркийн Comex дээрх үнэ Лондонгийн металлын биржийн үнээс давсан нь арбитражийн боломжийг ч үүсгээд байгаа аж. Хэрэв тариф хэрэгжвэл зэсийн үнэ 12,000-13,000 ам.долларт хүрч өсөх магадлалтай байна.",
      img: "/card_img_3.png",
    },
    {
      id: "2",
      title: "Ам.долларын индекс сүүлийн гурван жилийн доод түвшинд хүрлээ",
      description:
        "Тариф, эдийн засгийн хэтийн төлөв болон Холбооны нөөцийн сангийн хараат бус байдал алдагдах зэрэг хүчин зүйлс нь хөрөнгө оруулагчдын хүлээлтийг бууруулж буйтай холбоотойгоор ам.долларын индекс сүүлийн гурван жилийн доод түвшинд хүрч 2025 он гарснаас хойш 8.8%-иар сулраад байна. Goldman Sachs-ийн шинжээчид долларын индексийн 90, 95, 101 болон 107 гэсэн үнийн түвшнүүд гол анхаарал хандуулах бүс гэж үзэж байгаа бөгөөд одоогийн уналтын шалтгааныг дараах байдлаар тайлбарлаж байна: • Худалдааны бодлого ба тарифууд – АНУ-ын Ерөнхийлөгчийн зүгээс өргөн хүрээтэй тарифуудыг хэрэгжүүлж эхэлсэн нь, дэлхийн эдийн засгийн өсөлтөд сөргөөр нөлөөлөх нөхцөл байдалд хүргэж байна. Энэ нь хөрөнгө оруулагчдын итгэлийг бууруулж, долларын ханшид дарамт учруулж байгаа",
      img: "/card_img_2.png",
    },
    {
      id: "3",
      title: "АНУ-д 3 дугаар сарын байдлаар зэсийн импорт 600% өслөө",
      description:
        "АНУ-ын ерөнхийлөгч Д.Трамд өнгөрсөн 2 дугаар сард худалдааны яамандаа зэсийн импортын тарифын асуудлаар судалгаа хийхийг үүрэгдсэний дараа 3 дугаар сард тус улсын зэсийн импорт 70,000 тонноос 500,000 орчим тоннд хүрч 600 гаруй хувиар өссөн тухай Mercuria Energy Group мэдээллээ. АНУ-ын зэсийн жилийн хэрэглээ 1.6 сая тоннд хүрсэн ч дотоодын үйлдвэрлэл жилийн нийт хэрэглээний 50%-ийг л хангахуйц байгаа тул тус улсын засгийн газрын зүгээс дотоодын үйлдвэрлэлийг сэргээх зорилгоор тариф ногдуулахаар төлөвлөж байгаа аж. Иймд тариф хэрэгжихээс урьтан импортын хэмжээ өссөн бөгөөд Нью-Йоркийн Comex дээрх үнэ Лондонгийн металлын биржийн үнээс давсан нь арбитражийн боломжийг ч үүсгээд байгаа аж. Хэрэв тариф хэрэгжвэл зэсийн үнэ 12,000-13,000 ам.долларт хүрч өсөх магадлалтай байна.",
      img: "/card_img_3.png",
    },
  ]

  return (
    <>
      <section className='bg-[#050B1A] py-10 px-6 md:px-12 md:p-[100px] '>
        <div className='max-w-[1280px] mx-auto'>
          <div className='flex justify-between mb-[50px]'>
            <div className='flex gap-2.5'>
              <Button variant='transparent'>{t("category")}</Button>
              <Button variant='transparent'>{t("category")}</Button>
              <Button variant='transparent'>{t("category")}</Button>
            </div>
            <div className='relative '>
              <span className='absolute left-4 top-1/2 -translate-y-1/2 text-white'>
                <SearchIcon />
              </span>
              <input
                type='text'
                placeholder={t("search")}
                className='w-full pl-12 pr-5 py-2 rounded-[24px] bg-[#1B2B44] text-white outline-none placeholder:text-[#8CA3BA]'
              />
            </div>
          </div>
          <div className='  grid grid-cols-1 md:grid-cols-3 gap-[50px]'>
            {news.map((news, index) => (
              <NewsCard key={index} {...news} />
            ))}
          </div>
        </div>
      </section>
      <ContactUsForm />
    </>
  )
}

export default NewsInsightPage
